In [1]:
import pandas as pd
df_csv = pd.read_csv('../data/people.csv')
df_csv

     name  age       city
0    Aman   25      Delhi
1  Bhavna   30     Mumbai
2  Chetan   22       Pune
3   Divya   28  Bangalore

In [2]:
df_csv.head(3)

     name  age    city
0    Aman   25   Delhi
1  Bhavna   30  Mumbai
2  Chetan   22    Pune

In [4]:
df_csv.columns

Index(['name', 'age', 'city'], dtype='object')

In [5]:
len(df_csv)

4

In [6]:
df_csv['age'].max()

np.int64(30)

In [8]:
df_csv[df_csv['age']>25]

     name  age       city
1  Bhavna   30     Mumbai
3   Divya   28  Bangalore

In [9]:
df_csv[df_csv['city']=='Delhi']

   name  age   city
0  Aman   25  Delhi

In [11]:
df_csv[(df_csv['age']>23) & (df_csv['city'].isin(['Mumbai','Pune']) )]

     name  age    city
1  Bhavna   30  Mumbai

In [12]:
df_csv['age_2_years_later']=df_csv['age']+2
df_csv

     name  age       city  age_2_years_later
0    Aman   25      Delhi                 27
1  Bhavna   30     Mumbai                 32
2  Chetan   22       Pune                 24
3   Divya   28  Bangalore                 30

In [13]:
df_csv['name_length']=df_csv['name'].str.len()
df_csv

     name  age       city  age_2_years_later  name_length
0    Aman   25      Delhi                 27            4
1  Bhavna   30     Mumbai                 32            6
2  Chetan   22       Pune                 24            6
3   Divya   28  Bangalore                 30            5

In [14]:
df_csv.groupby('city')['age'].mean()

city
Bangalore    28.0
Delhi        25.0
Mumbai       30.0
Pune         22.0
Name: age, dtype: float64

In [15]:
df_csv.groupby('city')['name'].count()

city
Bangalore    1
Delhi        1
Mumbai       1
Pune         1
Name: name, dtype: int64